Here is a quick intro to pandas, hopefully showing how to do most simple things!

See the documentation for a full list of functions - this is very helpful! https://pandas.pydata.org/pandas-docs/stable/reference/io.html

# Introduction to pandas

To import pandas:

In [5]:
import pandas as pd

other useful packages:

In [35]:
import numpy as np
from datetime import datetime, timedelta

## Creating a dataframe

The main component of the pandas module is the DataFrame object. You can make dataframes from arrays, or load many different file types as dataframes.

To load a .csv file as a dataframe:

In [141]:
df = pd.read_csv(r"C:\Users\shann\OneDrive\Documents\Research\Workspace\Data\SSW\HCME_B__20081212_01_pa_slice_264_degrees.csv")

This is what the df looks like:

In [11]:
df

,Unnamed: 0,time,front,el,el_lo,el_hi
0,0,2008-12-12 15:29:37,Draw INNER front,5.057011,4.550341,5.564929
1,1,2008-12-12 16:09:36,Draw INNER front,5.584429,5.076464,6.093670
2,2,2008-12-12 16:49:37,Draw INNER front,6.483638,5.993232,6.994703
3,3,2008-12-12 17:29:37,Draw INNER front,6.130293,5.660101,6.620981
4,4,2008-12-12 18:09:36,Draw INNER front,6.365852,5.914865,6.837347
...,...,...,...,...,...,...
121,37,2008-12-13 16:09:36,Draw THIRD front,15.065154,14.586565,15.603429
122,38,2008-12-13 16:49:36,Draw THIRD front,16.557358,15.999618,17.074903
123,39,2008-12-13 17:29:36,Draw THIRD front,NaN,NaN,NaN
124,40,2008-12-13 18:09:36,Draw THIRD front,NaN,NaN,NaN
125,41,2008-12-13 18:49:36,Draw THIRD front,NaN,NaN,NaN

You can see which columns the df contains:

In [13]:
df.columns

Index(['Unnamed: 0', 'time', 'front', 'el', 'el_lo', 'el_hi'], dtype='object')

How many rows the df contains:

In [14]:
len(df)

126

When you create a dataframe, it's important to make sure that the columns are the correct data type. Usually pandas guesses the data type correctly, but it never seems to notice dates - the column 'time' has been read as list of strings, and needs to be converted to a list of datetime instances.

In [53]:
df['time'] = pd.to_datetime(df['time'])

You can change the data type of a column using:

In [56]:
df['el'] = df['el'].astype(str)

## Selecting data

You can select a column with one of the following:

In [15]:
df['time']
df.time

0      2008-12-12 15:29:37
1      2008-12-12 16:09:36
2      2008-12-12 16:49:37
3      2008-12-12 17:29:37
4      2008-12-12 18:09:36
              ...
121    2008-12-13 16:09:36
122    2008-12-13 16:49:36
123    2008-12-13 17:29:36
124    2008-12-13 18:09:36
125    2008-12-13 18:49:36
Name: time, Length: 126, dtype: object

To select a value from a column, you use the index of the dataframe row (the first column above!).

In [16]:
df.index

RangeIndex(start=0, stop=126, step=1)

In [19]:
df['time'][0]

'2008-12-12 15:29:37'

You can create a new dataframe containing a subset of the data. For example, here we are making a new dataframe containing all rows for which the 'el' value is greater than 20.

In [82]:
new_df = df[df['el'] > 20]
new_df

,time,front,el,el_lo,el_hi,new_column,el_plus_el_hi
40,2008-12-13 18:09:36,Draw INNER front,20.445181,19.872360,21.036732,40.0,41.481913
41,2008-12-13 18:49:36,Draw INNER front,20.622492,20.010342,21.174168,41.0,41.796659
76,2008-12-13 14:09:36,Draw OUTER front,20.488758,19.381855,21.198208,76.0,41.686966
77,2008-12-13 14:49:37,Draw OUTER front,21.866392,20.744900,22.454554,77.0,44.320946
81,2008-12-13 17:29:36,Draw OUTER front,20.978369,19.833517,22.059446,81.0,43.037815
82,2008-12-13 18:09:36,Draw OUTER front,22.340115,21.338762,22.985928,82.0,45.326042

More examples:

In [76]:
new_df2 = df[df['front'] == "Draw INNER front"]
new_df3 = df[df['time'] > datetime(2008, 12, 12, 12, 12)]

To load column values which meet a condition:

In [78]:
col_vals = df['time'][df['el'] <= 6]
col_vals

0     2008-12-12 15:29:37.000000
1     2008-12-12 16:09:36.000000
87    2008-12-12 17:29:37.000000
88    2008-12-12 18:09:36.000000
89    2008-12-12 18:49:36.000000
90    2008-12-12 19:29:36.000000
91    2008-12-12 20:09:36.000000
92    2008-12-12 20:49:36.000000
127   2020-08-25 21:50:00.385289
128   2020-08-25 21:50:07.518064
129   2020-08-25 21:50:15.726674
Name: time, dtype: datetime64[ns]

To select all rows with non NaN values in a column:

In [100]:
df_not_nan = df[df['el'].notnull()]

Note, when subsetting the data, the rows keep their indices from the orginal dataframe. So if you want to loop over rows in a dataframe, i would recommend looping over the index:

In [87]:
for i in new_df.index:
    print(new_df['time'][i])

2008-12-13 18:09:36
2008-12-13 18:49:36
2008-12-13 14:09:36
2008-12-13 14:49:37
2008-12-13 17:29:36
2008-12-13 18:09:36

Also, a cool trick I learnt is to use enumerate when you do a for loop, this gives you the number of the iteration and the value, e.g.

In [89]:
for n, i in enumerate(new_df.index):
    print(n, i)

0 40
1 41
2 76
3 77
4 81
5 82

You can also get an array of a dataframe column, which you can index as normal:

In [94]:
new_df['el'].values

array([20.44518089, 20.62249184, 20.48875809, 21.86639214, 20.97836876,
       22.34011459])

In [95]:
new_df['el'].values[0]

20.445180892944336

To find a list of unique values in a column:

In [96]:
df['front'].unique()

array(['Draw INNER front', 'Draw OUTER front', 'Draw THIRD front',
       'Imaginary'], dtype=object)

## Adding / removing data

You can add a new column to the dataframe quite easily:

In [31]:
new_col_vals = range(0, 126)
df['new_column'] = new_col_vals

You can make a new column from existing column values:

In [34]:
df["el_plus_el_hi"] = df["el"] + df["el_hi"]

To add a new row to a dataframe:

In [66]:
df = df.append({'Unnamed: 0' : 1099,
                'time' : datetime.now(),
                'front' : 'Imaginary',
                'el' : 5,
                'el_hi' : 6,
                'el_lo' : 4}, ignore_index=True)
df[df['Unnamed: 0'] == 1099]

,Unnamed: 0,time,front,el,el_lo,el_hi,new_column,el_plus_el_hi
126,1099,2020-08-25 21:32:24.964344,Imaginary,5.0,4.0,6.0,NaN,NaN
127,1099,2020-08-25 21:50:00.385289,Imaginary,5.0,4.0,6.0,NaN,NaN
128,1099,2020-08-25 21:50:07.518064,Imaginary,5.0,4.0,6.0,NaN,NaN
129,1099,2020-08-25 21:50:15.726674,Imaginary,5.0,4.0,6.0,NaN,NaN

To remove a column or row:

In [ ]:
df = df.drop(columns=['Unnamed: 0'])

In [71]:
df = df.drop([126])

To remove rows containing NaNs in the el column:

In [122]:
df = df.dropna(subset=['el'])

## Other ways of making dataframes

You can make a dataframe from a few arrays, e.g.

In [113]:
houses = ['Gryffindor', 'Gryffindor', 'Ravenclaw', 'Slytherin']
galleons = [65, 2, 8, 107]
names = ['Harry', 'Hagrid', 'Luna', 'Draco']
hp_df = pd.DataFrame({'house' : houses, 'galleons' : galleons, 'name' : names})
hp_df

        house  galleons    name
0  Gryffindor        65   Harry
1  Gryffindor         2  Hagrid
2   Ravenclaw         8    Luna
3   Slytherin       107   Draco

You can merge two dataframes together, e.g.

In [116]:
hp_df2 = pd.DataFrame({'name' : names, 'pet' : ['owl', 'dragon', 'crumple-horned snorkack', 'owl']})
hp_df2

     name                      pet
0   Harry                      owl
1  Hagrid                   dragon
2    Luna  crumple-horned snorkack
3   Draco                      owl

In [119]:
hp_df3 = pd.merge(hp_df, hp_df2, on='name')
hp_df3

        house  galleons    name                      pet
0  Gryffindor        65   Harry                      owl
1  Gryffindor         2  Hagrid                   dragon
2   Ravenclaw         8    Luna  crumple-horned snorkack
3   Slytherin       107   Draco                      owl

## Other stuff

You can sort the dataframe rows by their values in a column:

In [125]:
df = df.sort_values(by='el')

You can check whether a dataframe contains any rows - this is useful because often code will throw an error when this happens. df.empty will be True if there are no rows, and False if there are rows.

In [127]:
df.empty

False

In [140]:
empty_df = pd.DataFrame({'sorting_hat' : []})
empty_df.empty

True

To rename a column

In [142]:
df = df.rename(columns={'el' : 'giant_squid'})
df.columns

Index(['Unnamed: 0', 'time', 'front', 'giant_squid', 'el_lo', 'el_hi'], dtype='object')